In [13]:
# SQL Analysis â€“ Sales Insights

# This notebook demonstrates how SQL can be used together with Python
# to extract business insights from a SQLite database.

In [14]:
#Import

import sqlite3
import pandas as pd

# Connect to SQLite database
conn = sqlite3.connect("../data/sales.db")

In [15]:
# Query to list all tables available in the SQLite database
query = """
SELECT name 
FROM sqlite_master 
WHERE type='table';
"""

# Displaying the result as a DataFrame
pd.read_sql(query, conn)

    name
0  sales

In [16]:
# SQL query to calculate total revenue across all sales
query = """
SELECT 
    SUM(revenue) AS total_revenue
FROM sales;
"""

# Executing the query and displaying the result
pd.read_sql(query, conn)

   total_revenue
0           6850

In [ ]:
# SQL query to calculate total revenue grouped by product
query = """
SELECT 
    product,
    SUM(revenue) AS total_revenue
FROM sales
GROUP BY product
ORDER BY total_revenue DESC;
"""

# Displaying revenue performance by product
pd.read_sql(query, conn)

In [ ]:
# SQL query to calculate total revenue grouped by region
query = """
SELECT 
    region,
    SUM(revenue) AS total_revenue
FROM sales
GROUP BY region
ORDER BY total_revenue DESC;
"""

# Displaying revenue performance by region
pd.read_sql(query, conn)

In [ ]:
# Closing the database connection to free resources
conn.close()